[
  {
  "month": "Octobre 2025",
  "title": "Optimal control with state constraints for cancer chemotherapy and treatment optimization",
  "speaker": "David Lassounon (INSA Rennes, France)",
  "abstract": "The success of chemotherapy depends on the effectiveness of the drug-delivery strategy and its ability to destroy cancer cells while minimizing damage to healthy tissues. In this talk, we address an optimal control problem with state constraints for the chemotherapy of invasive tumors, where the drug acts as the control variable. Because drugs affect both cancer and healthy tissues, the objective is to curb tumor progression while limiting toxicity to normal tissue. We model drug effects on tumor invasiveness with a nonlinear reaction–diffusion equation. We first present a mathematical analysis of the initial–boundary value problem. We then formulate the constrained optimal control problem, discuss the role of different types of constraints, and derive first-order necessary optimality conditions. Finally, we show numerical simulations of optimal strategies for breast-cancer eradication in realistic 2D and 3D geometries, and outline future directions.",
  "keywords": "cancer, nonlinear reaction–diffusion equation, optimal control, chemotherapy, state constraints",
  "bio": "David Lassounon is a Temporary Teaching and Research Associate (ATER) at INSA Rennes and a Ph.D. candidate at IRMAR, supervised by Professors Aziz Belmiloudi and Mounir Haddou. His doctoral research develops and analyzes mathematical models of tumor invasion under chemotherapy, with a focus on optimal control strategies that limit tumor progression while reducing drug-induced toxicity. He also studies electromagnetic field propagation at media–metal interfaces, including optimal control of surface plasmon generation and propagation. His interests include PDEs, mathematical biology, optimal control, state-constrained problems, numerical analysis, and scientific computing. Originally from Benin, he holds master’s degrees from the University of Abomey-Calavi (IMSP – Institut de Mathématiques et de Sciences Physiques) and Université Paris-Saclay.",
  "slides": "",
  "video": ""
}

  {
    "month": "Novembre 2025",
    "title": "(À compléter)",
    "speaker": "Mohammad Akil (UPHF Valenciennes, France)",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Décembre 2025",
    "title": "Multiagent Reinforcement Learning for Traffic Signal Control",
    "speaker": "Mohammed Safwen Markou (Tunis, Tunisie)",
    "abstract": "Approches RL multi-agents pour l’optimisation coordonnée des feux de signalisation.",
    "bio": "Chercheur à Tunis.",
    "slides": "",
    "video": ""
  },
  {
    "month": "Janvier 2026",
    "title": "(À compléter)",
    "speaker": "—",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Février 2026",
    "title": "(À compléter)",
    "speaker": "Boubacar Diallo (PAUSTI, Bamako, Mali)",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Mars 2026",
    "title": "(À compléter)",
    "speaker": "Cyprien Tamekue (Washington Univ in St. Louis, USA)",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Avril 2026",
    "title": "(À compléter)",
    "speaker": "Clotilde Djuikem (Univ Manitoba, Canada)",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Mai 2026",
    "title": "(À compléter)",
    "speaker": "Nyamador Komla David ADENYO (CHU de Québec-Université Laval)",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Juin 2026",
    "title": "(À compléter)",
    "speaker": "—",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Juillet 2026",
    "title": "(À compléter)",
    "speaker": "Nana Téwendé Emmanuel (Nazi Boni, Burkina-Faso)",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  }
]
