[
  {
    "month": "Octobre 2025",
    "title": " Optimal control problem with state constraints for cancer chemotherapy and treatment optimization",
    "speaker": "David Lassousnon (INSA-Rennes, France)",
    "abstract": "The success of chemotherapy depends on the effectiveness of the drug delivery strategy and its ability to destroy cancer cells while minimizing damage to healthy tissues. In this talk, we address an optimal control problem with state constraints in the chemotherapy of invasive tumors. Here, the drug serves as a control variable. Since drugs affect both cancer cells and healthy tissues, the main objective of the control problem is to reduce the progression of tumor cells while minimizing damage to normal tissues. We use a nonlinear reaction-diffusion equation to model the effects of drugs on tumor invasiveness.

We start with the mathematical analysis of this initial boundary value problem. Then, we formulate the constrained optimal control problem, explain the role of different types of constraints, and develop the necessary optimality conditions. Finally, we present numerical simulations of the optimal strategies for eradicating breast cancer in realistic 2D and 3D geometries, followed by future perspectives.

Keywords: hashtag#Cancer, hashtag#Nonlinear hashtag#Reaction-hashtag#Diffusion hashtag#Equation, hashtag#Control hashtag#Problem, hashtag#Chemotherapy, hashtag#State hashtag#Constraints.",
    "bio": "David Lassounon is a Temporary Teaching and Research Associate (ATER) at INSA Rennes and a Ph.D. candidate within IRMAR, supervised by Professors Aziz Belmiloudi and Mounir Haddou. His doctoral research focuses on developing and analyzing mathematical models of tumor invasion under chemotherapy, with an emphasis on optimal control strategies that minimize tumor resistance while reducing drug-induced damage to healthy tissue. He also works on electromagnetic field propagation problems at media–metal interfaces, exploring optimal control approaches for the generation and propagation of surface plasmons.

David’s research interests include PDEs, SPDEs, mathematical biology, optimal control theory, state constraints, numerical analysis, and simulations. He has presented his work at international conferences such as ICOA and OPTIMA, and published in venues including SIAM Journal on Numerical Analysis and Lecture Notes in Computer Science.

Originally from Benin, David holds master’s degrees from the University of Abomey-Calavi IMSP | Institut de Mathématiques et de Sciences Physiques and Université Paris-Saclay, where he was a recipient of the Sophie Germain Excellence Scholarship.",
    "slides": "",
    "video": ""
  },
  {
    "month": "Novembre 2025",
    "title": "(À compléter)",
    "speaker": "Mohammad Akil (UPHF Valenciennes, France)",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Décembre 2025",
    "title": "Multiagent Reinforcement Learning for Traffic Signal Control",
    "speaker": "Mohammed Safwen Markou (Tunis, Tunisie)",
    "abstract": "Approches RL multi-agents pour l’optimisation coordonnée des feux de signalisation.",
    "bio": "Chercheur à Tunis.",
    "slides": "",
    "video": ""
  },
  {
    "month": "Janvier 2026",
    "title": "(À compléter)",
    "speaker": "—",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Février 2026",
    "title": "(À compléter)",
    "speaker": "Boubacar Diallo (PAUSTI, Bamako, Mali)",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Mars 2026",
    "title": "(À compléter)",
    "speaker": "Cyprien Tamekue (Washington Univ in St. Louis, USA)",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Avril 2026",
    "title": "(À compléter)",
    "speaker": "Clotilde Djuikem (Univ Manitoba, Canada)",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Mai 2026",
    "title": "(À compléter)",
    "speaker": "Nyamador Komla David ADENYO (CHU de Québec-Université Laval)",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Juin 2026",
    "title": "(À compléter)",
    "speaker": "—",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  },
  {
    "month": "Juillet 2026",
    "title": "(À compléter)",
    "speaker": "Nana Téwendé Emmanuel (Nazi Boni, Burkina-Faso)",
    "abstract": "Résumé à venir.",
    "bio": "",
    "slides": "",
    "video": ""
  }
]
